<pre>
<?php
echo "------------【關聯式陣列】----------<br>";
//關聯式陣列
$a1 = [
    'name' => 'pabi',
    'age' => 10,
    'gender' => '女',
//    ★可以混用但盡量不要,index值會跑掉
    99,100
//    A:
//    0 : 99
//    1 : 100
];
echo "-------【print_r($);】-----<br>";
print_r($a1);
//A:
//Array
//(
//    [name] => pabi
//    [age] => 10
//    [gender] => 女
//[0] => 99
//    [1] => 100
//)
echo "-------【foreach($ as $=>$){}】-----<br>";
foreach($a1 as $A=>$B){
    echo "$A : $B<br>";
}
//A:
//name : pabi
//age : 10
//gender : 女
//0 : 99
//1 : 100
echo "------------【索引式陣列】----------<br>";
//索引式陣列
$a2 = [2,4,6,9,15];

echo "-------【foreach($ as $=>$){}】-----<br>";;
foreach($a2 as $A=>$B){
    echo "$A : $B<br>";
}
?>
<!--    A:-->
<!--    0 : 2-->
<!--    1 : 4-->
<!--    2 : 6-->
<!--    3 : 9-->
<!--    4 : 15-->
</pre>
